In [3]:
# Import dependencies
import pandas as pd
import matplotlib.pyplot as plt
import sqlalchemy
from config import password, user

In [6]:
# Create connection between Postgres and Python
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/Employee_DB')
connection = engine.connect()

In [13]:
# Create a query to find the necessary values
query = pd.read_sql_query(
'''select e.emp_no, s.salary
from employees as e
inner join salaries as s
on e.emp_no = s.emp_no
''', connection)

In [15]:
# Show first five rows to check 
query.head()

   emp_no  salary
0   57444   48973
1   13616   40000
2  240129   43548
3  427958   63377
4   35916   40000